# Question 1
Consider the following Python module: a = 0 def b(): global a a = c(a) def c(a): return a + 2 After importing the module into the interpreter, you execute:

b() b() b() a ? What value is displayed when the last expression (a) is evaluated? Explain your answer by indicating what happens in every executed statement.#

In [3]:
a = 0
def b():
 global a
 a = c(a)
def c(a):
 return a + 2

b()
# Calling fucction b prints 0. Now the value of a is 2
b()
## Calling fucction b prints 2. Now the value of a is 4
b()
## Calling fucction b prints 4. Now the value of a is 6
a
#Now the value is 6 so it prints 6

6

# Question 2
Function fileLength(), given to you, takes the name of a file as input and returns the length of the file:

fileLength('midterm.py') 284 fileLength('idterm.py') Traceback (most recent call last): File "<pyshell#34>", line 1, in fileLength('idterm.py') File "/Users/me/midterm.py", line 3, in fileLength infile = open(filename) FileNotFoundError: [Errno 2] No such file or directory: 'idterm.py' As shown above, if the file cannot be found by the interpreter or if it cannot be read as a text file, an exception will be raised. Modify function fileLength() so that a friendly message is printed instead: fileLength('midterm.py') 358 fileLength('idterm.py') File idterm.py not found.

In [2]:
def fileLength(str):
    try:
        with open('/Users/ankit/FileLength.txt') as f:
            file = open(str) 
            contents = file.read()
            file.close()
            print(len(contents)) # if file exists
    except IOError:
        print("I am sorry, No such File Directory exists") #If file doesn't exists

fileLength('/Users/ankit/FileLength.txt')
fileLength('/Users/ankit/helo.txt')

123
I am sorry, No such File Directory exists

# Question 3
Write a class named Marsupial that can be used as shown below:

m = Marsupial() m.put_in_pouch('doll') m.put_in_pouch('firetruck') m.put_in_pouch('kitten') m.pouch_contents() ['doll', 'firetruck', 'kitten'] Now write a class named Kangaroo as a subclass of Marsupial that inherits all the attributes of Marsupial and also: a. extends the Marsupial init constructor to take, as input, the coordinates x and y of the Kangaroo object, b. supports method jump that takes number values dx and dy as input and moves the kangaroo by dx units along the x-axis and by dy units along the yaxis, and c. overloads the str operator so it behaves as shown below. k = Kangaroo(0,0) print(k) I am a Kangaroo located at coordinates (0,0) k.put_in_pouch('doll') k.put_in_pouch('firetruck') k.put_in_pouch('kitten') k.pouch_contents() ['doll', 'firetruck', 'kitten'] k.jump(1,0) k.jump(1,0) k.jump(1,0) print(k) I am a Kangaroo located at coordinates (3,0)

In [4]:
class Marsupial(object):
        def __init__(self):
            self.contents = []
        def put_in_pouch(self, thing):
            self.contents.append(thing)
        def pouch_contents(self):
            print(self.contents)


class Kangaroo(Marsupial):
    def __init__(self, x, y):
        super(Kangaroo, self).__init__()
        self.x = x
        self.y = y
    def jump(self, dx, dy):
        self.x = self.x + dx
        self.y = self.y + dy
    
    def __str__(self):
        return "I am a Kangaroo located at coordinates ({}, {})".format(self.x, self.y)
    
k = Kangaroo(0,0)
print(k)
k.put_in_pouch("doll")
k.put_in_pouch("firetruck")
k.put_in_pouch("kitten")
k.pouch_contents()
k.jump(1,0)
k.jump(1,0)
k.jump(1,0)
print(k)

I am a Kangaroo located at coordinates (0, 0)
['doll', 'firetruck', 'kitten']
I am a Kangaroo located at coordinates (3, 0)

# Question 4
Write function collatz() that takes a positive integer x as input and prints the Collatz sequence starting at x. A Collatz sequence is obtained by repeatedly applying this rule to the previous number x in the sequence: x = { 洧논/2 洧녰洧녭 洧논 洧녰洧 洧뉧롐洧뉧롐 3洧논 + 1 洧녰洧녭 洧논 洧녰洧 洧녶洧녬洧녬 Your function should stop when the sequence gets to number 1. Your implementation must be recursive, without any loops.

In [5]:
f = True
def collatz(x):
    global f
    if x == 1:
        if f == True:
            print('1')
            return
        else:
            y = 1
    else:
        f = False
        if x%2==0:
            x = x//2 
            print(x)
            collatz(x)
        else:
            x = 3*x + 1
            print(x)
            collatz(x)
            
collatz(1)
print('\n')
collatz(10)

1


5
16
8
4
2
1

# Question 5
Write a recursive method binary() that takes a non-negative integer n and prints the binary representation of integer n.

binary(0) 0 binary(1) 1 binary(3) 11 binary(9) 1001

In [6]:
binaryNum = ""
def binary(num):
    global binaryNum
    if num > 1:
        binary(num//2)
    binaryNum += str(num % 2)
    return int(binaryNum)
#binary(0)
#binary(1)
#binary(3)
binary(14)

1110

# Question 6
Implement a class named HeadingParser that can be used to parse an HTML document, and retrieve and print all the headings in the document. You should implement your class as a subclass of HTMLParser, defined in Standard Library module html.parser. When fed a string containing HTML code, your class should print the headings, one per line and in the order in which they appear in the document. Each heading should be indented as follows: an h1 heading should have indentation 0, and h2 heading should have indentation 1, etc. Test your implementation using w3c.html.

In [7]:
from html.parser import HTMLParser 

class headingparser(HTMLParser): 
    def __init__(self): 
        self.flag = False 
        self.indent = 0 
        self.stack = [] 
        super().__init__()

    def handle_starttag(self, tag, attrs): 
        if(tag[0] == 'h' and tag[1] <='6' and tag[1] > '0' and len(tag) == 2): 
            self.stack.append("") 

    def handle_endtag(self, tag):
        if (tag[0] == 'h' and tag[1] <= '6' and tag[1] > '0' and len(tag) == 2):
            indent = int(tag[1]) - 1  
            for i in range(0,indent):
                print("\t",end="")
            print(self.stack.pop())

    def handle_data(self, data): 
        if(len(self.stack) != 0): 
            str = self.stack.pop()
            str+=data 
            self.stack.append(str)

with open('/Users/ankit/w3c.html') as f: 

            file = open('/Users/ankit/w3c.html')
            contents = file.read()
            file.close()
            obj = headingparser() 
            obj.feed(contents)

W3C Mission
	Principles

# Question 7
Implement recursive function webdir() that takes as input: a URL (as a string) and non-negative integers depth and indent. Your function should visit every web page reachable from the starting URL web page in depth clicks or less, and print each web page's URL. As shown below, indentation, specified by indent, should be used to indicate the depth of a URL.

webdir('http://reed.cs.depaul.edu/lperkovic/csc242/test1.html' , 2, 0) http://reed.cs.depaul.edu/lperkovic/csc242/test1.html http://reed.cs.depaul.edu/lperkovic/csc242/test2.html http://reed.cs.depaul.edu/lperkovic/csc242/test4.html http://reed.cs.depaul.edu/lperkovic/csc242/test3.html http://reed.cs.depaul.edu/lperkovic/csc242/test4.html

In [8]:
import requests
from bs4 import BeautifulSoup

def webdir(base, path, visited, depth=3, indent=0):
    if indent < depth:
        try:
            soup = BeautifulSoup(requests.get(base + path).text, "html.parser")
            for link in soup.find_all("a"):
                href = link.get("href")
                if href not in visited:
                    visited.add(href)
                    print_in_indentation(indent, href)
                    webdir(base, href, visited, depth, indent + 1 )
        except:
            pass

def print_in_indentation(indent, href):
    for indentation in range(indent):
        print ("\t" , end = '')
    print(href)
    
webdir("https://www.cbc.ca/contents", "", set(["https://www.cbc.ca/"]), 3, 0)

https://pubads.g.doubleclick.net/gampad/ad?iu=5876/miscsz=728x90&c=123456789
	http://www.cbc.ca
		/sitemap/
		https://www.cbc.ca
		https://www.cbc.ca/television/
		https://www.cbc.ca/radio/
		https://www.cbc.ca/news
		https://www.cbc.ca/sports
		https://www.cbcmusic.ca/
		https://www.cbc.ca/life
		/arts/
		https://www.cbc.ca/kidscbc2/
		https://www.cbc.ca/news/canada#region-nav
		https://www.cbc.ca/documentaries/
		https://www.cbc.ca/comedy
		https://www.cbc.ca/books/
		https://www.cbc.ca/parents/
		https://www.cbc.ca/news/indigenous
		https://www.cbc.ca/archives/
		https://www.cbc.ca/kids/games/
		http://www.cbc.ca/contests/
		https://www.cbc.ca/mycbc/
		https://www.cbc.ca/sitemap/
		https://cbchelp.cbc.ca/hc/en-ca/categories/115000249853-Help-with-CBC-Apps
		https://www.cbc.ca/rss/
		https://www.cbc.ca/radio/podcasts/
		https://subscriptions.cbc.ca/listmanagement
		http://www.cbc.radio-canada.ca/en
		https://www.cbc.ca/appearances/
		https://cbchelp.cbc.ca/hc/en-us/sections/203864688-Using-or-licensing-CBC-content
		https://www.cbc.ca/aboutcbc/discover/termsofuse.html
		https://www.cbc.ca/aboutcbc/discover/privacy.html
		https://www.cbcshop.ca/
		https://cbchelp.cbc.ca
		https://cbchelp.cbc.ca/hc/en-ca/requests/new
		http://www.cbc.radio-canada.ca/en/explore/jobs/
		http://www.cbc.radio-canada.ca/en/explore/doing-business-with-us/
		/productionfacilities/
		http://www.cbc.radio-canada.ca/
		https://ici.radio-canada.ca/

# Question 8
Write SQL queries on the below database table that return:

In [1]:
%load_ext sql
%sql sqlite://

%sql create table Rain(City varchar(100),Country varchar(100),Season varchar(100),Temperature_C float ,Rainfall_mm float );
%sql insert into Rain values('Mumbai','India', 'Winter',24.8,5.9);
%sql insert into Rain values('Mumbai','India', 'Spring',28.4,16.2);
%sql insert into Rain values('Mumbai','India', 'Summer',27.9,1549.4);
%sql insert into Rain values('Mumbai','India', 'Fall',27.6,346.0);
%sql insert into Rain values('London','United Kingdom', 'Winter',4.2,207.7);
%sql insert into Rain values('London','United Kingdom', 'Spring',8.3,169.6);
%sql insert into Rain values('London','United Kingdom', 'Summer',15.7,157.0);
%sql insert into Rain values('London','United Kingdom', 'Fall',10.4,218.5);
%sql insert into Rain values('Cairo','Eqypt', 'Winter',13.6,16.5);
%sql insert into Rain values('Cairo','Eqypt', 'Spring',20.7,6.5);
%sql insert into Rain values('Cairo','Eqypt', 'Summer',27.7,0.1);
%sql insert into Rain values('Cairo','Eqypt', 'Fall',22.2,4.5);

 * sqlite://
Done.
 * sqlite://
1 rows affected.
 * sqlite://
1 rows affected.
 * sqlite://
1 rows affected.
 * sqlite://
1 rows affected.
 * sqlite://
1 rows affected.
 * sqlite://
1 rows affected.
 * sqlite://
1 rows affected.
 * sqlite://
1 rows affected.
 * sqlite://
1 rows affected.
 * sqlite://
1 rows affected.
 * sqlite://
1 rows affected.
 * sqlite://
1 rows affected.

[]

In [9]:
%sql SELECT * FROM Rain;

 * sqlite://
Done.

[('Mumbai', 'India', 'Winter', 24.8, 5.9),
 ('Mumbai', 'India', 'Spring', 28.4, 16.2),
 ('Mumbai', 'India', 'Summer', 27.9, 1549.4),
 ('Mumbai', 'India', 'Fall', 27.6, 346.0),
 ('London', 'United Kingdom', 'Winter', 4.2, 207.7),
 ('London', 'United Kingdom', 'Spring', 8.3, 169.6),
 ('London', 'United Kingdom', 'Summer', 15.7, 157.0),
 ('London', 'United Kingdom', 'Fall', 10.4, 218.5),
 ('Cairo', 'Eqypt', 'Winter', 13.6, 16.5),
 ('Cairo', 'Eqypt', 'Spring', 20.7, 6.5),
 ('Cairo', 'Eqypt', 'Summer', 27.7, 0.1),
 ('Cairo', 'Eqypt', 'Fall', 22.2, 4.5)]

In [10]:
#a) All the temperature data

%sql select Temperature_C from Rain;

 * sqlite://
Done.

[(24.8,),
 (28.4,),
 (27.9,),
 (27.6,),
 (4.2,),
 (8.3,),
 (15.7,),
 (10.4,),
 (13.6,),
 (20.7,),
 (27.7,),
 (22.2,)]

In [11]:
#All the cities, but without repetition

%sql select City from Rain group by City;

 * sqlite://
Done.

[('Cairo',), ('London',), ('Mumbai',)]

In [12]:
#All the records for India
%sql select * from Rain where Country = 'India';

 * sqlite://
Done.

[('Mumbai', 'India', 'Winter', 24.8, 5.9),
 ('Mumbai', 'India', 'Spring', 28.4, 16.2),
 ('Mumbai', 'India', 'Summer', 27.9, 1549.4),
 ('Mumbai', 'India', 'Fall', 27.6, 346.0)]

In [13]:
#d) All the Fall records.

%sql select * from Rain where Season = 'Fall';

 * sqlite://
Done.

[('Mumbai', 'India', 'Fall', 27.6, 346.0),
 ('London', 'United Kingdom', 'Fall', 10.4, 218.5),
 ('Cairo', 'Eqypt', 'Fall', 22.2, 4.5)]

In [14]:
#e) The city, country, and season for which the average rainfall is between 200
#and 400 millimeters

%sql select City, Country,Season from Rain where Rainfall_mm between 200 and 400;

 * sqlite://
Done.

[('Mumbai', 'India', 'Fall'),
 ('London', 'United Kingdom', 'Winter'),
 ('London', 'United Kingdom', 'Fall')]

In [15]:
#f) The city and country for which the average Fall temperature is above 20
#degrees, in increasing temperature order.

%sql select City, Country from Rain where Season = 'Fall' and Temperature_C > 20 order by Temperature_C;

 * sqlite://
Done.

[('Cairo', 'Eqypt'), ('Mumbai', 'India')]

In [16]:
# g) The total annual rainfall for Cairo.

%sql select sum(Rainfall_mm) from Rain where City = 'Cairo';

 * sqlite://
Done.

[(27.6,)]

In [17]:
# h) The total rainfall for each season.

%sql select Season, sum(Rainfall_mm) from Rain group by Season;

 * sqlite://
Done.

[('Fall', 569.0),
 ('Spring', 192.29999999999998),
 ('Summer', 1706.5),
 ('Winter', 230.1)]

# Question 9 . Suppose list words is defined as follows:

words = ['The', 'quick', 'brown', 'fox', 'jumps', 'over',

'the', 'lazy', 'dog'] Write list comprehension expressions that use list words and generate the following lists: a) ['THE', 'QUICK', 'BROWN', 'FOX', 'JUMPS', 'OVER', 'THE', 'LAZY', 'DOG'] b) ['the', 'quick', 'brown', 'fox', 'jumps', 'over', 'the', 'lazy', 'dog'] c) [3, 5, 5, 3, 5, 4, 3, 4, 3] (the list of lengths of words in list words). d) [['THE', 'the', 3], ['QUICK', 'quick', 5], ['BROWN', 'brown', 5], ['FOX', 'fox', 3], ['JUMPS', 'jumps', 5], ['OVER', 'over', 4], ['THE', 'the', 3], ['LAZY', 'lazy', 4], ['DOG', 'dog', 3]] (the list containing a list for every word of list words, where each list contains the word in uppercase and lowercase and the length of the word.) e) ['The', 'quick', 'brown', 'fox', 'jumps', 'over', 'the', 'lazy', 'dog'] (the list of words in list words containing 4 or more characters.)

In [19]:
words = ['The', 'quick', 'brown', 'fox', 'jumps', 'over', 
'the', 'lazy', 'dog']
upper_case = []
lower_case = []
string_length = []
word_info_arr = []
word_filter = []
for word in words:
    upper_case.append(word.upper())
    lower_case.append(word.lower())
    string_length.append(len(word))
    word_info_arr.append([word.upper(), word.lower(), len(word)])
    if len(word) > 3:
        word_filter.append(word)
print(upper_case)
print(lower_case)
print(string_length)
print(word_info_arr)
print(word_filter)

['THE', 'QUICK', 'BROWN', 'FOX', 'JUMPS', 'OVER', 'THE', 'LAZY', 'DOG']
['the', 'quick', 'brown', 'fox', 'jumps', 'over', 'the', 'lazy', 'dog']
[3, 5, 5, 3, 5, 4, 3, 4, 3]
[['THE', 'the', 3], ['QUICK', 'quick', 5], ['BROWN', 'brown', 5], ['FOX', 'fox', 3], ['JUMPS', 'jumps', 5], ['OVER', 'over', 4], ['THE', 'the', 3], ['LAZY', 'lazy', 4], ['DOG', 'dog', 3]]
['quick', 'brown', 'jumps', 'over', 'lazy']